// ООП 

// Загальні ідеї ООП
/*
    1.ООП збудоване навколо об'єктів.
    2. Поділ потрібний для того, щоб було створювати, обслуговувати та перетворювати якісь 
        частини програми, не впливаючи на інші
    3.Сенс об'єкта у тому, що він має якісь методи, він вміє щось робити ,при чому ,
        інші об'єкти не знають як він це робить
    4.Об'єкт має поняття атрибуту та методу
        Атрибут - будь-яку дані, які зберігаються всередині об'єкта
        Методи - будь-які дії, які можна здійснювати над об'єктом, атрибувати об'єкта
        Атрибути зазвичай виражаються змінними, а методи функціями
    5. Об'єкти можна створювати за шаблоном - такі шаблони називають КЛАСАМИ

*/


/*
    Абстракція - коли ми зосереджуємося, тільки на суттєвих для завдання деталях(коли описуємо його)
        і ігноруємо все інше. Чим менше характеристик , тим краще Абстракція. 
    АЛЕ ключові характеристики не можна прибирати

    Щоб працювати з Абстракція, використовують інтерфейс. Інтерфейс - це спосіб взаємодії з об'єктом,
        який визначає, які операції можна здійснити з цим об'єктом та які дані можна отримати або змінити

    Скриваємо неважливу для користувача інформацію і надаємо тільки необхідну для користування.
*/


/*
    Інкапсуляція - процес об'єднання даних та методів в обному об'єкті і приховування деталей
        реалізації від користувача.
*/


// Різниця між Абстракцією та Інкапсуляції:
/*
  Інкапсуляція зосереджена на організації та приховуванні деталей реалізації об'єкта.

  Абстракція спрощує складність системи , шляхом виділення ключових аспектів та приховування
    незначних деталей  
*/


// Спадкування - здатність до копіювання, можливість описати новий клас на основі вже існуючого.